Enums/ВидыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДокументов</Name>
			<Comment>Виды подтверждающих документов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сертификат</Name>
					<Comment>Сертификат</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидНаЖительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Свидетельство</Name>
					<Comment>Свидетельство</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпискаИзЭлектронногоПаспорта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лицензия</Name>
					<Comment>Лицензия</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паспорт</Name>
					<Comment>Общегражданский паспорт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удостоверение</Name>
					<Comment>Удостоверение личности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доверенность</Name>
					<Comment>Доверенность</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВоенныйБилет</Name>
					<Comment>Военный билет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справка</Name>
					<Comment>Справка (например об освобождении)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервиснаяКнижка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий документ удостоверяющий личность</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПТС</Name>
					<Comment>Паспорт транспортного средства</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АттестатТО</Name>
					<Comment>Аттестат аккредитации оператора технического осмотра транспортных средств</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПодтверждающиеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ПодтверждающиеДокументы</Name>
			<Comment>Данные всех подтверждающих документов по всем объектам</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.Сотрудники</xr:Item>
				<xr:Item>Catalog.Автомобили</xr:Item>
				<xr:Item>Catalog.ПодразделенияКомпании</xr:Item>
				<xr:Item>Catalog.CRM_ПотенциальныеКонтрагенты</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Document.РеализацияАвтомобилей</xr:Item>
				<xr:Item>Document.РеализацияАктивов</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПодтверждающегоДокумента</Name>
					<Comment>Вид подтверждающего документа</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Comment>Серия документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Comment>Номер документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Comment>Дата выдачи подтверждающего документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания срока действия подтверждающего документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КемВыдан</Name>
					<Comment>Кем выдан подтверждающий документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБланка</Name>
					<Comment>Номер бланка подтверждающего документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текущий</Name>
					<Comment>Признак того, что документ актуален в данный момент</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Устаревший</Name>
					<Comment>Признак того, что документ устарел и не используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДоверенности</Name>
					<Comment>Паспорт или др. удостоверение личности для доверенности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик, от которого получают материальные ценности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Юридическое лицо, от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лицензия</Name>
					<Comment>Лицензия фирмы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа, всегда рубли.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВРеестреОператоровТО</Name>
					<Comment>Номер в реестре операторов технического осмотра</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПодразделения</Name>
					<Comment>Код подразделения выдавшего документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПТСОригинал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>Таблица товаров и услуг</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар, услуга и т.п.)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество единиц измерения номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СМ_ФормированиеЭПТСизПисем/Ext/Module.bsl
Процедура СформироватьВыпискиЭПТС() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлектронноеПисьмо.Ссылка КАК ЭлПисьмо,
		|	ЭлектронноеПисьмо.Дата,
		|	ЭлектронноеПисьмо.ОтправительПредставление,
		|	ЭлектронноеПисьмо.Тема,
		|	ЭлектронноеПисьмо.Обработано
		|ИЗ
		|	Документ.ЭлектронноеПисьмо КАК ЭлектронноеПисьмо
		|ГДЕ
		|	ЭлектронноеПисьмо.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ЭлектронноеПисьмо.ОтправительПредставление ПОДОБНО &ОтправительПредставление
		|	И ЭлектронноеПисьмо.Тема ПОДОБНО &Тема
		|	И ЭлектронноеПисьмо.Обработано = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата())-864000);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ОтправительПредставление", "%%"+"no-reply@zspd-sep.elpts.ru"+"%%");
	Запрос.УстановитьПараметр("Тема", "%%"+"Выписка из электронного паспорта ТС (шасси ТС)"+"%%");
	
	Состав = Запрос.Выполнить().Выгрузить();
	
	Если Состав.Количество() > 0 Тогда
		ОбработатьПисьма(Состав);
	КонецЕсли; 
    
КонецПроцедуры

Процедура ОбработатьПисьма(Состав) Экспорт
	
	Для каждого Стр Из Состав Цикл
		
 		Если Не Стр.ЭлПисьмо.ЕстьВложения Тогда
		    Продолжить;
		КонецЕсли;
		
		Если Стр.ЭлПисьмо.ПрикрепленныеФайлы.Количество() <> 1 Тогда
		    Продолжить;
		КонецЕсли;
		
		ИмяФайла =  Стр.ЭлПисьмо.ПрикрепленныеФайлы[0].Имя;
		Файл     =  Стр.ЭлПисьмо.ПрикрепленныеФайлы[0].Файл;
		
		ТолькоИмяФайла = Сред(ИмяФайла,1,СтрДлина(ИмяФайла)-4);
 		ТолькоРасширениеФайла = Прав(ИмяФайла,4);
		
		ТолькоИмяФайла = Прав(СтрЗаменить(ТолькоИмяФайла,".","_"),37);
		ИмяФайла = ""+ТолькоИмяФайла+ТолькоРасширениеФайла;
		
		ВИН = "";
		//Бондаренко++ 20201223
		Если Найти(ИмяФайла,"Vypiska iz elektronnogo pasporta Identifikacionnyj nomer") > 0 Тогда
			ВИН = СокрЛП(СтрЗаменить(ИмяФайла,"Vypiska iz elektronnogo pasporta Identifikacionnyj nomer","")); 
			ВИН = Сред(ВИН,1,Найти(ВИН," za")-1);
		КонецЕсли; 
		//Бондаренко-- 20201223
 			
		ТемаПисьма = СокрЛП(Стр.ЭлПисьмо.Тема);
		ДатаПисьмаСтрокой = Прав(СокрЛП(Стр.ЭлПисьмо.Тема),16);
		
		Год    = Сред(ДатаПисьмаСтрокой,  7, 4);
		Месяц  = Сред(ДатаПисьмаСтрокой,  4, 2);
		День   = Сред(ДатаПисьмаСтрокой,  1, 2);
		Час    = Сред(ДатаПисьмаСтрокой, 12, 2);
		Минута = Сред(ДатаПисьмаСтрокой, 15, 2);
		
		ДатаПисьма = Дата(Год, Месяц, День, Час, Минута, 0 );
		
		ТекстПисьма = СокрЛП(Стр.ЭлПисьмо.ТекстПисьма);
		ТекстПисьма = Сред(ТекстПисьма,СтрНайти(ТекстПисьма," № ")+ 3);
		НомерЭПТС   = Сред(ТекстПисьма,1,СтрНайти(ТекстПисьма,".")-1);
		
		//Бондаренко++ 20201223
		Если Врег(Прав(ИмяФайла,4)) <> ".PDF" Тогда
		    ИмяФайла = ВРЕГ(СокрЛП(ИмяФайла))+".PDF";
		КонецЕсли; 
		//Бондаренко-- 20201223		
		
		Успешно = Ложь;
  		Успешно = ОбработатьТекПисьмо(ВИН,ДатаПисьма,НомерЭПТС,ИмяФайла,Файл);
		Если Успешно Тогда
		    ЭлПисьмоОбъект = Стр.ЭлПисьмо.ПолучитьОбъект();
			ЭлПисьмоОбъект.Обработано = Истина;
			Попытка
				ЭлПисьмоОбъект.Записать();
 			Исключение
				//			
			КонецПопытки; 
 		КонецЕсли; 
 		
 	КонецЦикла;
	
КонецПроцедуры

Функция ОбработатьТекПисьмо(ВИН,ДатаПисьма,НомерЭПТС,ИмяФайла,Файл) Экспорт
	
	ТекДок = Справочники.ПодтверждающиеДокументы.ПустаяСсылка();
	
	Если обЗначениеНеЗаполнено(ВИН) Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодтверждающиеДокументы.Ссылка,
		|	ПодтверждающиеДокументы.ВидПодтверждающегоДокумента,
		|	ПодтверждающиеДокументы.Номер,
		|	ПодтверждающиеДокументы.Устаревший
		|ИЗ
		|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
		|ГДЕ
		|	ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.ВыпискаИзЭлектронногоПаспорта)
		|	И ПодтверждающиеДокументы.Номер = &Номер
		|	И ПодтверждающиеДокументы.Устаревший = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Номер", НомерЭПТС);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Если ТЗ.Количество() > 0 Тогда
			ТекДок = ТЗ[0].Ссылка;
		КонецЕсли;
		
	Иначе	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Автомобили.Ссылка КАК Авто,
		|	Автомобили.VIN
		|ИЗ
		|	Справочник.Автомобили КАК Автомобили
		|ГДЕ
		|	Автомобили.VIN = &VIN";
		
		Запрос.УстановитьПараметр("VIN",ВИН);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Если ТЗ.Количество() <> 1 Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ТекАвто = ТЗ[0].Авто;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодтверждающиеДокументы.Владелец,
		|	ПодтверждающиеДокументы.ВидПодтверждающегоДокумента,
		|	ПодтверждающиеДокументы.Номер,
		|	ПодтверждающиеДокументы.ДатаВыдачи,
		|	ПодтверждающиеДокументы.Ссылка,
		|	ПодтверждающиеДокументы.Комментарий,
		|	ПодтверждающиеДокументы.Устаревший
		|ИЗ
		|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
		|ГДЕ
		|	ПодтверждающиеДокументы.Владелец = &Владелец
		|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.ВыпискаИзЭлектронногоПаспорта)
		|	И ПодтверждающиеДокументы.Номер = &Номер
		|	И ПодтверждающиеДокументы.ДатаВыдачи = &ДатаВыдачи
		|	И ПодтверждающиеДокументы.Комментарий ПОДОБНО &Комментарий
		|	И ПодтверждающиеДокументы.Устаревший = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Владелец", ТекАвто);
		Запрос.УстановитьПараметр("ДатаВыдачи", НачалоДня(ДатаПисьма));
		Запрос.УстановитьПараметр("Номер", НомерЭПТС);
		Запрос.УстановитьПараметр("Комментарий", "%%"+ДатаПисьма+"%%");
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Если ТЗ.Количество() = 0 Тогда
			ТекДок = Справочники.ПодтверждающиеДокументы.СоздатьЭлемент();
			ТекДок.Владелец = ТекАвто;
			ТекДок.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.ВыпискаИзЭлектронногоПаспорта;
			ТекДок.Дата = ДатаПисьма;
			ТекДок.ДатаВыдачи = ДатаПисьма;
			ТекДок.Номер = НомерЭПТС;
			ТекДок.Наименование = "Выписка из электронного паспорта № "+НомерЭПТС+" выдана "+Формат(ДатаПисьма,"ДЛФ=D");
			ТекДок.Комментарий  = ДатаПисьма;
			Попытка
				ТекДок.Записать();
			Исключение
				Возврат Ложь;
			КонецПопытки;
		Иначе	
			ТекДок = ТЗ[0].Ссылка;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если обЗначениеНеЗаполнено(ТекДок)  Тогда
 		Возврат Ложь;
 	КонецЕсли; 
	
  	Попытка
		рфСохранитьФайлНаДиске(Файл,""+КаталогВременныхФайлов()+ИмяФайла, , "ДА");
 	Исключение
 		Возврат Ложь;
 	КонецПопытки; 
 	
 	
  	ТекОб = ТекДок;
	ПолноеИмяФайла = ""+КаталогВременныхФайлов()+ИмяФайла;
	
	ПользовательскоеИмяФайла = Сред(ИмяФайла,1,СтрДлина(ИмяФайла)-4);
		
 	БылиОшибки=Ложь;
	
	АдресВХранилище = "ОШИБКА";
	
	Попытка
 		АдресВХранилище = ЗаписатьНовуюКартинку(ПользовательскоеИмяФайла,ПолноеИмяФайла,ТекОб);
 	Исключение
 		Возврат Ложь;
	КонецПопытки;
 
	Возврат Истина;
 
КонецФункции // ОбработатьТекПисьмо(ВИН,ДатаПисьма,НомерЭПТС,ИмяФайла,Файл);

 Функция ЗаписатьНовуюКартинку(Название,ТекИФ,ТекОб) Экспорт
	
	ОтносительныйПутьСошибкой = "Ошибочный путь";
	
	ДатаСнимка = ТекущаяДата(); 
 	
	КаталогВременныхФайлов = ТекИФ;
	МояКартинка  = Новый ХранилищеЗначения(Новый ДвоичныеДанные(КаталогВременныхФайлов));
	
	МояКартинка =    МояКартинка;
	
	ПарамКаталога = Новый Массив;

	НаименБезСпецСимволов = УбратьЗапрещенные(Название);
 	
	ТекРасширение = "."+Врег(рфПолучитьРасширениеФайла(ТекИФ));
	
  	ПарамКаталога.Добавить(НаименБезСпецСимволов+"-"+СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка(Формат(ДатаСнимка,"ДЛФ=DT")),":","_"),".","_")," ","_")+ТекРасширение);
	ПарамКаталога.Добавить(ТекОб);
	ПарамКаталога.Добавить("");
	ПарамКаталога.Добавить(ДатаСнимка);
	ПарамКаталога.Добавить("");
	ПарамКаталога.Добавить("");
	ПарамКаталога.Добавить("");
	ПарамКаталога.Добавить("");
	ПарамКаталога.Добавить("");
	ПарамКаталога.Добавить("");
	
  	ОписаниеОшибки = "";                                                                                 
	//Бондаренко++ 20220323
 	//ПолноеИмяФайла = ОбщиеСервер.СкопироватьНаСервер("Файлы",МояКартинка,ТекРасширение,ОписаниеОшибки);
	ПолноеИмяФайла = СМ_ФайловоеХранилище.СкопироватьНаСервер("Файлы",МояКартинка,ТекРасширение,ОписаниеОшибки);
	//Бондаренко++ 20220323
	Если ОписаниеОшибки <> "" Тогда
		//Сообщить(ОписаниеОшибки,СтатусСообщения.ОченьВажное);
	КонецЕсли; 
 	ИмяФайла = ПарамКаталога[0]; 
	
	ПриставкаИБ = Константы.ПрефиксБазы.Получить();
	Идентификатор = ПриставкаИБ+СтрЗаменить(ТекущаяУниверсальнаяДатаВМиллисекундах(),Символы.НПП,"");
	
	ИмяФайлаВстроки  = обРазложитьСтрокуВМассивПодстрок(ПолноеИмяФайла,"\");
 	МаксЗначениеИндекса = ИмяФайлаВстроки.Количество()-1;
	
	Попытка
		Идентификатор = СокрЛП(ВРЕГ(ИмяФайлаВстроки[МаксЗначениеИндекса]));
		Идентификатор = СтрЗаменить(Идентификатор,ТекРасширение,"");
	Исключение
		//
	КонецПопытки;
 	
	РазмерФайла =  ПарамКаталога[4];
	ДатаСохранения = ДатаСнимка;
	НазваниеФайла = ПарамКаталога[1];
	Картинка = ПарамКаталога[7];
	
	Если ТекРасширение = ".BMP"  Или
		 ТекРасширение = ".DIB"  Или
		 ТекРасширение = ".RLE"  Или
		 ТекРасширение = ".JPG"  Или
		 ТекРасширение = ".JPEG" Или
		 ТекРасширение = ".TIF"  Или
		 ТекРасширение = ".GIF"  Или
		 ТекРасширение = ".PNG"  Или
		 ТекРасширение = ".ICO"  Или
		 ТекРасширение = ".WMF"  Или
		 ТекРасширение = ".RMF"  Тогда
		ЭтоКартинка = Истина;
	Иначе	
		ЭтоКартинка = Ложь;
	КонецЕсли;	
	
  	ИмяФайла = ПолноеИмяФайла;
 	ОтносительныйПуть = СтрЗаменить(ПолноеИмяФайла,Константы.ПустьКХранилищюСканов.Получить()+"\"+СокрЛП(ОбщиеСервер.ПолучитьИмяИБ())+"\","");
  	Расширение =  ТекРасширение;
 	
	НаборКФ = РегистрыСведений.КартинкиИФайлы.СоздатьНаборЗаписей();
	НаборКФ.Отбор.Объект.Установить(ТекОб.Ссылка);
	НаборКФ.Отбор.Идентификатор.Установить(Идентификатор);
	
	НаборКФ.Прочитать();
	
	НовыйКФ = НаборКФ.Добавить();
	НовыйКФ.Объект =  ТекОб.Ссылка;
	НовыйКФ.Идентификатор = Идентификатор;
	
	НовыйКФ.ИмяФайла = СтрЗаменить(ИмяФайла,"""","");
	НовыйКФ.ДатаСохранения = ДатаСохранения;
	НовыйКФ.РазмерФайла = РазмерФайла;
	НовыйКФ.Комментарий = "Загружена автоматически "+ТекущаяДата();
	НовыйКФ.Картинка = ЭтоКартинка;
	НовыйКФ.НазваниеФайла = СтрЗаменить(НаименБезСпецСимволов,"""","");
	НовыйКФ.ОтносительныйПуть = ОтносительныйПуть;
	НовыйКФ.Расширение = Расширение;
	Если ТипЗнч(ТекОб) = Тип("СправочникСсылка.Сотрудники") Тогда
   		НовыйКФ.Основной = Истина;
		НовыйКФ.Данные = МояКартинка;
		НовыйКФ.ДанныеВоВнешнемФайле = Ложь;
    Иначе
	   НовыйКФ.Основной = Ложь;
	   НовыйКФ.Данные = "";
	   НовыйКФ.ДанныеВоВнешнемФайле = Истина;
   КонецЕсли;
   
   НовыйКФ.Отметка = Ложь;
   
   Попытка
   		НаборКФ.Записать();
   Исключение
   	    Возврат ОтносительныйПутьСошибкой;
   КонецПопытки; 
    
   Возврат ОтносительныйПуть;
	
КонецФункции
 
Функция УбратьЗапрещенные(Название) Экспорт

	НазваниеОтПользователя = Строка(Название);
	НаименБезСпецСимволов = СтрЗаменить(НазваниеОтПользователя,"""","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,"/","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,"\","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,"~","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,"`","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,"!","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,"@","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,"#","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,"№","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,";","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,"$","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,"%","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,"^","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,"&","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,"*","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,"(","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,")","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,"_","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,"+","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,"|","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,"{+","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,"}","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,"[","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,"]","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,"№","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,";","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,":","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,"?","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,"<","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,">","");
	НазваниеОтПользователя = СтрЗаменить(НазваниеОтПользователя,"-","");
  	
	Возврат НазваниеОтПользователя;
 
КонецФункции // УбратьЗапрещенные()()
